Revit 2027 API
BuiltInFailures.IlluminationFailures.RoomLightLossFactorWarning Property
 Estimated Illumination failed. Light Loss factor not set for lighting fixture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomLightLossFactorWarning { get; }
Public Shared ReadOnly Property RoomLightLossFactorWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomLightLossFactorWarning {
	FailureDefinitionId^ get ();
}
static member RoomLightLossFactorWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.IlluminationFailures Class
Autodesk.Revit.DB Namespace